Revit 2027 API
ParameterTypeId.PlacementParamsShow Property
 "Enable Position Parameters"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlacementParamsShow { get; }
Public Shared ReadOnly Property PlacementParamsShow As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlacementParamsShow {
	ForgeTypeId^ get ();
}
static member PlacementParamsShow : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace